# Snapshot report for `test/prefer-object-define-properties.mjs`

The actual snapshot is saved in `prefer-object-define-properties.mjs.snap`.

Generated by [AVA](https://avajs.dev).

## Invalid #1
      1 | Object.defineProperty(foo, "load", {
      2 |     value: () => {},
      3 |     writable: true
      4 | });
      5 | Object.defineProperty(foo, bar, {
      6 |     value: null,
      7 |     writable: true
      8 | });

> Output

    `␊
      1 | Object.defineProperties(foo, {"load": {␊
      2 |     value: () => {},␊
      3 |     writable: true␊
      4 | },[bar]: {␊
      5 |     value: null,␊
      6 |     writable: true␊
      7 | }});␊
      8 |␊
    `

> Error 1/1

    `␊
      1 | Object.defineProperty(foo, "load", {␊
      2 |     value: () => {},␊
      3 |     writable: true␊
      4 | });␊
    > 5 | Object.defineProperty(foo, bar, {␊
        | ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^␊
    > 6 |     value: null,␊
        | ^^^^^^^^^^^^^^^^␊
    > 7 |     writable: true␊
        | ^^^^^^^^^^^^^^^^␊
    > 8 | });␊
        | ^^^ Prefer \`Object.defineProperties\` over multiple \`Object.defineProperty\`.␊
    `

## Invalid #2
      1 | Object.defineProperty(foo, "build", {
      2 |     value: null,
      3 |     writable: true
      4 | });
      5 | Object.defineProperty(foo, "load", bar);

> Output

    `␊
      1 | Object.defineProperties(foo, {"build": {␊
      2 |     value: null,␊
      3 |     writable: true␊
      4 | },"load": bar});␊
      5 |␊
    `

> Error 1/1

    `␊
      1 | Object.defineProperty(foo, "build", {␊
      2 |     value: null,␊
      3 |     writable: true␊
      4 | });␊
    > 5 | Object.defineProperty(foo, "load", bar);␊
        | ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ Prefer \`Object.defineProperties\` over multiple \`Object.defineProperty\`.␊
    `

## Invalid #3
       1 | Object.defineProperty(foo, "load", {
       2 |     value: () => {},
       3 |     writable: true
       4 | });
       5 | {}
       6 | Object.defineProperty(foo, "test", {
       7 |     value: null,
       8 |     writable: true
       9 | });
      10 | Object.defineProperty(foo, "test-b", {
      11 |     value: null,
      12 |     writable: true
      13 | });

> Output

    `␊
       1 | Object.defineProperty(foo, "load", {␊
       2 |     value: () => {},␊
       3 |     writable: true␊
       4 | });␊
       5 | {}␊
       6 | Object.defineProperties(foo, {"test": {␊
       7 |     value: null,␊
       8 |     writable: true␊
       9 | },"test-b": {␊
      10 |     value: null,␊
      11 |     writable: true␊
      12 | }});␊
      13 |␊
    `

> Error 1/1

    `␊
       1 | Object.defineProperty(foo, "load", {␊
       2 |     value: () => {},␊
       3 |     writable: true␊
       4 | });␊
       5 | {}␊
       6 | Object.defineProperty(foo, "test", {␊
       7 |     value: null,␊
       8 |     writable: true␊
       9 | });␊
    > 10 | Object.defineProperty(foo, "test-b", {␊
         | ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^␊
    > 11 |     value: null,␊
         | ^^^^^^^^^^^^^^^^␊
    > 12 |     writable: true␊
         | ^^^^^^^^^^^^^^^^␊
    > 13 | });␊
         | ^^^ Prefer \`Object.defineProperties\` over multiple \`Object.defineProperty\`.␊
    `

## Invalid #4
      1 | Object.defineProperty(foo, "test", {
      2 |     value: () => {},
      3 |     writable: true
      4 | });			
      5 | Object.defineProperties(foo, {bar});
      6 | Object.defineProperties(foo, {baz});

> Output

    `␊
      1 | Object.defineProperties(foo, {"test": {␊
      2 |     value: () => {},␊
      3 |     writable: true␊
      4 | },bar,baz});			␊
      5 |␊
      6 |␊
    `

> Error 1/1

    `␊
      1 | Object.defineProperty(foo, "test", {␊
      2 |     value: () => {},␊
      3 |     writable: true␊
      4 | });			␊
      5 | Object.defineProperties(foo, {bar});␊
    > 6 | Object.defineProperties(foo, {baz});␊
        | ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ Prefer \`Object.defineProperties\` over multiple \`Object.defineProperty\`.␊
    `

## Invalid #5
      1 | Object.defineProperty(foo, "test", {
      2 | 	value: () => {},
      3 | 	writable: true
      4 | });			
      5 | Object.defineProperties(foo, {bar});
      6 | Object.defineProperties(foo, {baz});
      7 | Object.defineProperties(foo, {qux});

> Output

    `␊
      1 | Object.defineProperties(foo, {"test": {␊
      2 | 	value: () => {},␊
      3 | 	writable: true␊
      4 | },bar,baz,qux});			␊
      5 |␊
      6 |␊
      7 |␊
    `

> Error 1/1

    `␊
      1 | Object.defineProperty(foo, "test", {␊
      2 | 	value: () => {},␊
      3 | 	writable: true␊
      4 | });			␊
      5 | Object.defineProperties(foo, {bar});␊
      6 | Object.defineProperties(foo, {baz});␊
    > 7 | Object.defineProperties(foo, {qux});␊
        | ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ Prefer \`Object.defineProperties\` over multiple \`Object.defineProperty\`.␊
    `
