# Snapshot report for `test/require-module-specifiers.js`

The actual snapshot is saved in `require-module-specifiers.js.snap`.

Generated by [AVA](https://avajs.dev).

## invalid(1): import {} from "foo";

> Input

    `␊
      1 | import {} from "foo";␊
    `

> Error 1/1

    `␊
    > 1 | import {} from "foo";␊
        |         ^ import declaration without specifiers is not allowed.␊
    ␊
    --------------------------------------------------------------------------------␊
    Suggestion 1/2: Remove this import declaration.␊
      1 |␊
    ␊
    --------------------------------------------------------------------------------␊
    Suggestion 2/2: Switch to side effect import.␊
      1 | import   "foo";␊
    `

## invalid(2): import{}from"foo";

> Input

    `␊
      1 | import{}from"foo";␊
    `

> Error 1/1

    `␊
    > 1 | import{}from"foo";␊
        |        ^ import declaration without specifiers is not allowed.␊
    ␊
    --------------------------------------------------------------------------------␊
    Suggestion 1/2: Remove this import declaration.␊
      1 |␊
    ␊
    --------------------------------------------------------------------------------␊
    Suggestion 2/2: Switch to side effect import.␊
      1 | import"foo";␊
    `

## invalid(3): import foo, {} from "foo";

> Input

    `␊
      1 | import foo, {} from "foo";␊
    `

> Output

    `␊
      1 | import foo  from "foo";␊
    `

> Error 1/1

    `␊
    > 1 | import foo, {} from "foo";␊
        |              ^ import declaration without specifiers is not allowed.␊
    `

## invalid(4): import foo,{}from "foo";

> Input

    `␊
      1 | import foo,{}from "foo";␊
    `

> Output

    `␊
      1 | import foo from "foo";␊
    `

> Error 1/1

    `␊
    > 1 | import foo,{}from "foo";␊
        |             ^ import declaration without specifiers is not allowed.␊
    `

## invalid(5): import foo,{}/* comment */from "foo";

> Input

    `␊
      1 | import foo,{}/* comment */from "foo";␊
    `

> Output

    `␊
      1 | import foo/* comment */from "foo";␊
    `

> Error 1/1

    `␊
    > 1 | import foo,{}/* comment */from "foo";␊
        |             ^ import declaration without specifiers is not allowed.␊
    `

## invalid(6): import type {} from "foo";

> Input

    `␊
      1 | import type {} from "foo";␊
    `

> Output

    `␊
      1 |␊
    `

> Error 1/1

    `␊
    > 1 | import type {} from "foo";␊
        |              ^ import declaration without specifiers is not allowed.␊
    `

## invalid(7): import type{}from"foo";

> Input

    `␊
      1 | import type{}from"foo";␊
    `

> Output

    `␊
      1 |␊
    `

> Error 1/1

    `␊
    > 1 | import type{}from"foo";␊
        |             ^ import declaration without specifiers is not allowed.␊
    `

## invalid(8): import type foo, {} from "foo";

> Input

    `␊
      1 | import type foo, {} from "foo";␊
    `

> Output

    `␊
      1 | import type foo  from "foo";␊
    `

> Error 1/1

    `␊
    > 1 | import type foo, {} from "foo";␊
        |                   ^ import declaration without specifiers is not allowed.␊
    `

## invalid(9): import type foo,{}from "foo";

> Input

    `␊
      1 | import type foo,{}from "foo";␊
    `

> Output

    `␊
      1 | import type foo from "foo";␊
    `

> Error 1/1

    `␊
    > 1 | import type foo,{}from "foo";␊
        |                  ^ import declaration without specifiers is not allowed.␊
    `
