# Snapshot report for `test/require-module-specifiers.js`

The actual snapshot is saved in `require-module-specifiers.js.snap`.

Generated by [AVA](https://avajs.dev).

## invalid(1): import {} from "foo";

> Input

    `␊
      1 | import {} from "foo";␊
    `

> Error 1/1

    `␊
    > 1 | import {} from "foo";␊
        |        ^^ import statement without specifiers is not allowed.␊
    ␊
    --------------------------------------------------------------------------------␊
    Suggestion 1/2: Remove this import statement.␊
      1 |␊
    ␊
    --------------------------------------------------------------------------------␊
    Suggestion 2/2: Switch to side effect import.␊
      1 | import   "foo";␊
    `

## invalid(2): import{}from"foo";

> Input

    `␊
      1 | import{}from"foo";␊
    `

> Error 1/1

    `␊
    > 1 | import{}from"foo";␊
        |       ^^ import statement without specifiers is not allowed.␊
    ␊
    --------------------------------------------------------------------------------␊
    Suggestion 1/2: Remove this import statement.␊
      1 |␊
    ␊
    --------------------------------------------------------------------------------␊
    Suggestion 2/2: Switch to side effect import.␊
      1 | import"foo";␊
    `

## invalid(3): import { } from "foo";

> Input

    `␊
      1 | import {␊
      2 | } from "foo";␊
    `

> Error 1/1

    `␊
    > 1 | import {␊
        |        ^␊
    > 2 | } from "foo";␊
        | ^^ import statement without specifiers is not allowed.␊
    ␊
    --------------------------------------------------------------------------------␊
    Suggestion 1/2: Remove this import statement.␊
      1 |␊
    ␊
    --------------------------------------------------------------------------------␊
    Suggestion 2/2: Switch to side effect import.␊
      1 | import ␊
      2 |   "foo";␊
    `

## invalid(4): import foo, {} from "foo";

> Input

    `␊
      1 | import foo, {} from "foo";␊
    `

> Output

    `␊
      1 | import foo  from "foo";␊
    `

> Error 1/1

    `␊
    > 1 | import foo, {} from "foo";␊
        |             ^^ import statement without specifiers is not allowed.␊
    `

## invalid(5): import foo,{}from "foo";

> Input

    `␊
      1 | import foo,{}from "foo";␊
    `

> Output

    `␊
      1 | import foo from "foo";␊
    `

> Error 1/1

    `␊
    > 1 | import foo,{}from "foo";␊
        |            ^^ import statement without specifiers is not allowed.␊
    `

## invalid(6): import foo, { } from "foo";

> Input

    `␊
      1 | import foo, {␊
      2 | } from "foo";␊
    `

> Output

    `␊
      1 | import foo ␊
      2 |  from "foo";␊
    `

> Error 1/1

    `␊
    > 1 | import foo, {␊
        |             ^␊
    > 2 | } from "foo";␊
        | ^^ import statement without specifiers is not allowed.␊
    `

## invalid(7): import foo,{}/* comment */from "foo";

> Input

    `␊
      1 | import foo,{}/* comment */from "foo";␊
    `

> Output

    `␊
      1 | import foo/* comment */from "foo";␊
    `

> Error 1/1

    `␊
    > 1 | import foo,{}/* comment */from "foo";␊
        |            ^^ import statement without specifiers is not allowed.␊
    `

## invalid(8): import type {} from "foo";

> Input

    `␊
      1 | import type {} from "foo";␊
    `

> Output

    `␊
      1 |␊
    `

> Error 1/1

    `␊
    > 1 | import type {} from "foo";␊
        |             ^^ import statement without specifiers is not allowed.␊
    `

## invalid(9): import type{}from"foo";

> Input

    `␊
      1 | import type{}from"foo";␊
    `

> Output

    `␊
      1 |␊
    `

> Error 1/1

    `␊
    > 1 | import type{}from"foo";␊
        |            ^^ import statement without specifiers is not allowed.␊
    `

## invalid(10): import type foo, {} from "foo";

> Input

    `␊
      1 | import type foo, {} from "foo";␊
    `

> Output

    `␊
      1 | import type foo  from "foo";␊
    `

> Error 1/1

    `␊
    > 1 | import type foo, {} from "foo";␊
        |                  ^^ import statement without specifiers is not allowed.␊
    `

## invalid(11): import type foo,{}from "foo";

> Input

    `␊
      1 | import type foo,{}from "foo";␊
    `

> Output

    `␊
      1 | import type foo from "foo";␊
    `

> Error 1/1

    `␊
    > 1 | import type foo,{}from "foo";␊
        |                 ^^ import statement without specifiers is not allowed.␊
    `

## invalid(1): export {}

> Input

    `␊
      1 | export {}␊
    `

> Output

    `␊
      1 |␊
    `

> Error 1/1

    `␊
    > 1 | export {}␊
        |        ^^ export statement without specifiers is not allowed.␊
    `

## invalid(2): export type{}

> Input

    `␊
      1 | export type{}␊
    `

> Output

    `␊
      1 |␊
    `

> Error 1/1

    `␊
    > 1 | export type{}␊
        |            ^^ export statement without specifiers is not allowed.␊
    `

## invalid(3): export type {} from "foo";

> Input

    `␊
      1 | export type {} from "foo";␊
    `

> Output

    `␊
      1 |␊
    `

> Error 1/1

    `␊
    > 1 | export type {} from "foo";␊
        |             ^^ export statement without specifiers is not allowed.␊
    `

## invalid(4): declare export type {} from "foo";

> Input

    `␊
      1 | declare export type {} from "foo";␊
    `

> Output

    `␊
      1 |␊
    `

> Error 1/1

    `␊
    > 1 | declare export type {} from "foo";␊
        |                     ^^ export statement without specifiers is not allowed.␊
    `

## invalid(5): export {} from "foo";

> Input

    `␊
      1 | export {} from "foo";␊
    `

> Error 1/1

    `␊
    > 1 | export {} from "foo";␊
        |        ^^ export statement without specifiers is not allowed.␊
    ␊
    --------------------------------------------------------------------------------␊
    Suggestion 1/2: Remove this export statement.␊
      1 |␊
    ␊
    --------------------------------------------------------------------------------␊
    Suggestion 2/2: Switch to side effect import.␊
      1 | import   "foo";␊
    `

## invalid(6): export{}from"foo";

> Input

    `␊
      1 | export{}from"foo";␊
    `

> Error 1/1

    `␊
    > 1 | export{}from"foo";␊
        |       ^^ export statement without specifiers is not allowed.␊
    ␊
    --------------------------------------------------------------------------------␊
    Suggestion 1/2: Remove this export statement.␊
      1 |␊
    ␊
    --------------------------------------------------------------------------------␊
    Suggestion 2/2: Switch to side effect import.␊
      1 | import"foo";␊
    `

## invalid(7): export { } from "foo";

> Input

    `␊
      1 | export {␊
      2 | } from "foo";␊
    `

> Error 1/1

    `␊
    > 1 | export {␊
        |        ^␊
    > 2 | } from "foo";␊
        | ^^ export statement without specifiers is not allowed.␊
    ␊
    --------------------------------------------------------------------------------␊
    Suggestion 1/2: Remove this export statement.␊
      1 |␊
    ␊
    --------------------------------------------------------------------------------␊
    Suggestion 2/2: Switch to side effect import.␊
      1 | import ␊
      2 |   "foo";␊
    `

## invalid(8): export {} from "foo" with {type: "json"};

> Input

    `␊
      1 | export {} from "foo" with {type: "json"};␊
    `

> Error 1/1

    `␊
    > 1 | export {} from "foo" with {type: "json"};␊
        |        ^^ export statement without specifiers is not allowed.␊
    ␊
    --------------------------------------------------------------------------------␊
    Suggestion 1/2: Remove this export statement.␊
      1 |␊
    ␊
    --------------------------------------------------------------------------------␊
    Suggestion 2/2: Switch to side effect import.␊
      1 | import   "foo" with {type: "json"};␊
    `
