# Snapshot report for `test/require-module-attributes.js`

The actual snapshot is saved in `require-module-attributes.js.snap`.

Generated by [AVA](https://avajs.dev).

## invalid(1): import "foo" with {}

> Input

    `␊
      1 | import "foo" with {}␊
    `

> Output

    `␊
      1 | import "foo"  ␊
    `

> Error 1/1

    `␊
    > 1 | import "foo" with {}␊
        |                   ^^ import statement with empty attribute list is not allowed.␊
    `

## invalid(2): import foo from "foo" with {}

> Input

    `␊
      1 | import foo from "foo" with {}␊
    `

> Output

    `␊
      1 | import foo from "foo"  ␊
    `

> Error 1/1

    `␊
    > 1 | import foo from "foo" with {}␊
        |                            ^^ import statement with empty attribute list is not allowed.␊
    `

## invalid(3): export {foo} from "foo" with {}

> Input

    `␊
      1 | export {foo} from "foo" with {}␊
    `

> Output

    `␊
      1 | export {foo} from "foo"  ␊
    `

> Error 1/1

    `␊
    > 1 | export {foo} from "foo" with {}␊
        |                              ^^ export statement with empty attribute list is not allowed.␊
    `

## invalid(4): export * from "foo" with {}

> Input

    `␊
      1 | export * from "foo" with {}␊
    `

> Output

    `␊
      1 | export * from "foo"  ␊
    `

> Error 1/1

    `␊
    > 1 | export * from "foo" with {}␊
        |                          ^^ export statement with empty attribute list is not allowed.␊
    `

## invalid(5): export * from "foo"with{}

> Input

    `␊
      1 | export * from "foo"with{}␊
    `

> Output

    `␊
      1 | export * from "foo"␊
    `

> Error 1/1

    `␊
    > 1 | export * from "foo"with{}␊
        |                        ^^ export statement with empty attribute list is not allowed.␊
    `

## invalid(6): export * from "foo"/* comment 1 */with/* comment 2 */{/* comment 3 */}/* comment 4 */

> Input

    `␊
      1 | export * from "foo"/* comment 1 */with/* comment 2 */{/* comment 3 */}/* comment 4 */␊
    `

> Output

    `␊
      1 | export * from "foo"/* comment 1 *//* comment 2 *//* comment 3 *//* comment 4 */␊
    `

> Error 1/1

    `␊
    > 1 | export * from "foo"/* comment 1 */with/* comment 2 */{/* comment 3 */}/* comment 4 */␊
        |                                                      ^^^^^^^^^^^^^^^^^ export statement with empty attribute list is not allowed.␊
    `

## invalid(1): import("foo", {})

> Input

    `␊
      1 | import("foo", {})␊
    `

> Output

    `␊
      1 | import("foo" )␊
    `

> Error 1/1

    `␊
    > 1 | import("foo", {})␊
        |               ^^ import expression with empty attribute list is not allowed.␊
    `

## invalid(2): import("foo", (( {} )))

> Input

    `␊
      1 | import("foo", (( {} )))␊
    `

> Output

    `␊
      1 | import("foo"   )␊
    `

> Error 1/1

    `␊
    > 1 | import("foo", (( {} )))␊
        |                  ^^ import expression with empty attribute list is not allowed.␊
    `

## invalid(3): import("foo", {},)

> Input

    `␊
      1 | import("foo", {},)␊
    `

> Output

    `␊
      1 | import("foo" ,)␊
    `

> Error 1/1

    `␊
    > 1 | import("foo", {},)␊
        |               ^^ import expression with empty attribute list is not allowed.␊
    `

## invalid(4): import("foo", {with:{},},)

> Input

    `␊
      1 | import("foo", {with:{},},)␊
    `

> Output

    `␊
      1 | import("foo" ,)␊
    `

> Error 1/1

    `␊
    > 1 | import("foo", {with:{},},)␊
        |                     ^^ import expression with empty attribute list is not allowed.␊
    `

## invalid(5): import("foo", {with:{}, unknown:"unknown"},)

> Input

    `␊
      1 | import("foo", {with:{}, unknown:"unknown"},)␊
    `

> Output

    `␊
      1 | import("foo", { unknown:"unknown"},)␊
    `

> Error 1/1

    `␊
    > 1 | import("foo", {with:{}, unknown:"unknown"},)␊
        |                     ^^ import expression with empty attribute list is not allowed.␊
    `

## invalid(6): import("foo", {"with":{}, unknown:"unknown"},)

> Input

    `␊
      1 | import("foo", {"with":{}, unknown:"unknown"},)␊
    `

> Output

    `␊
      1 | import("foo", { unknown:"unknown"},)␊
    `

> Error 1/1

    `␊
    > 1 | import("foo", {"with":{}, unknown:"unknown"},)␊
        |                       ^^ import expression with empty attribute list is not allowed.␊
    `

## invalid(7): import("foo", {unknown:"unknown", with:{}, },)

> Input

    `␊
      1 | import("foo", {unknown:"unknown", with:{}, },)␊
    `

> Output

    `␊
      1 | import("foo", {unknown:"unknown",  },)␊
    `

> Error 1/1

    `␊
    > 1 | import("foo", {unknown:"unknown", with:{}, },)␊
        |                                        ^^ import expression with empty attribute list is not allowed.␊
    `

## invalid(8): import("foo", {unknown:"unknown", with:{} },)

> Input

    `␊
      1 | import("foo", {unknown:"unknown", with:{} },)␊
    `

> Output

    `␊
      1 | import("foo", {unknown:"unknown"  },)␊
    `

> Error 1/1

    `␊
    > 1 | import("foo", {unknown:"unknown", with:{} },)␊
        |                                        ^^ import expression with empty attribute list is not allowed.␊
    `

## invalid(9): import("foo", {unknown:"unknown", with:{}, unknown2:"unknown2", },)

> Input

    `␊
      1 | import("foo", {unknown:"unknown", with:{}, unknown2:"unknown2", },)␊
    `

> Output

    `␊
      1 | import("foo", {unknown:"unknown",  unknown2:"unknown2", },)␊
    `

> Error 1/1

    `␊
    > 1 | import("foo", {unknown:"unknown", with:{}, unknown2:"unknown2", },)␊
        |                                        ^^ import expression with empty attribute list is not allowed.␊
    `

## invalid(10): import("foo"/* comment 1 */, /* comment 2 */{/* comment 3 */}/* comment 4 */,/* comment 5 */)

> Input

    `␊
      1 | import("foo"/* comment 1 */, /* comment 2 */{/* comment 3 */}/* comment 4 */,/* comment 5 */)␊
    `

> Output

    `␊
      1 | import("foo"/* comment 1 */ /* comment 2 *//* comment 3 *//* comment 4 */,/* comment 5 */)␊
    `

> Error 1/1

    `␊
    > 1 | import("foo"/* comment 1 */, /* comment 2 */{/* comment 3 */}/* comment 4 */,/* comment 5 */)␊
        |                                             ^^^^^^^^^^^^^^^^^ import expression with empty attribute list is not allowed.␊
    `

## invalid(11): import("foo", {/* comment 1 */"with"/* comment 2 */:/* comment 3 */{/* comment 4 */}, }/* comment 5 */,)

> Input

    `␊
      1 | import("foo", {/* comment 1 */"with"/* comment 2 */:/* comment 3 */{/* comment 4 */}, }/* comment 5 */,)␊
    `

> Output

    `␊
      1 | import("foo" /* comment 1 *//* comment 2 *//* comment 3 *//* comment 4 */ /* comment 5 */,)␊
    `

> Error 1/1

    `␊
    > 1 | import("foo", {/* comment 1 */"with"/* comment 2 */:/* comment 3 */{/* comment 4 */}, }/* comment 5 */,)␊
        |                                                                    ^^^^^^^^^^^^^^^^^ import expression with empty attribute list is not allowed.␊
    `
